Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_dma.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; RP2350_dma.
; ===========

;------------------------------------------------------------------------
; Author:	Generated using the .svd description	The 2025-01-01
; Modifs:
;
; Project:	uKOS-X
; Goal:		RP2350_dma equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma	once

#include	<stdint.h>

// DMA address definitions
// -----------------------

typedef struct {
	volatile	uint32_t	CH0_READ_ADDR;
	volatile	uint32_t	CH0_WRITE_ADDR;
	volatile	uint32_t	CH0_TRANS_COUNT;
	volatile	uint32_t	CH0_CTRL_TRIG;
	volatile	uint32_t	CH0_AL1_CTRL;
	volatile	uint32_t	CH0_AL1_READ_ADDR;
	volatile	uint32_t	CH0_AL1_WRITE_ADDR;
	volatile	uint32_t	CH0_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH0_AL2_CTRL;
	volatile	uint32_t	CH0_AL2_TRANS_COUNT;
	volatile	uint32_t	CH0_AL2_READ_ADDR;
	volatile	uint32_t	CH0_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH0_AL3_CTRL;
	volatile	uint32_t	CH0_AL3_WRITE_ADDR;
	volatile	uint32_t	CH0_AL3_TRANS_COUNT;
	volatile	uint32_t	CH0_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH1_READ_ADDR;
	volatile	uint32_t	CH1_WRITE_ADDR;
	volatile	uint32_t	CH1_TRANS_COUNT;
	volatile	uint32_t	CH1_CTRL_TRIG;
	volatile	uint32_t	CH1_AL1_CTRL;
	volatile	uint32_t	CH1_AL1_READ_ADDR;
	volatile	uint32_t	CH1_AL1_WRITE_ADDR;
	volatile	uint32_t	CH1_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH1_AL2_CTRL;
	volatile	uint32_t	CH1_AL2_TRANS_COUNT;
	volatile	uint32_t	CH1_AL2_READ_ADDR;
	volatile	uint32_t	CH1_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH1_AL3_CTRL;
	volatile	uint32_t	CH1_AL3_WRITE_ADDR;
	volatile	uint32_t	CH1_AL3_TRANS_COUNT;
	volatile	uint32_t	CH1_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH2_READ_ADDR;
	volatile	uint32_t	CH2_WRITE_ADDR;
	volatile	uint32_t	CH2_TRANS_COUNT;
	volatile	uint32_t	CH2_CTRL_TRIG;
	volatile	uint32_t	CH2_AL1_CTRL;
	volatile	uint32_t	CH2_AL1_READ_ADDR;
	volatile	uint32_t	CH2_AL1_WRITE_ADDR;
	volatile	uint32_t	CH2_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH2_AL2_CTRL;
	volatile	uint32_t	CH2_AL2_TRANS_COUNT;
	volatile	uint32_t	CH2_AL2_READ_ADDR;
	volatile	uint32_t	CH2_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH2_AL3_CTRL;
	volatile	uint32_t	CH2_AL3_WRITE_ADDR;
	volatile	uint32_t	CH2_AL3_TRANS_COUNT;
	volatile	uint32_t	CH2_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH3_READ_ADDR;
	volatile	uint32_t	CH3_WRITE_ADDR;
	volatile	uint32_t	CH3_TRANS_COUNT;
	volatile	uint32_t	CH3_CTRL_TRIG;
	volatile	uint32_t	CH3_AL1_CTRL;
	volatile	uint32_t	CH3_AL1_READ_ADDR;
	volatile	uint32_t	CH3_AL1_WRITE_ADDR;
	volatile	uint32_t	CH3_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH3_AL2_CTRL;
	volatile	uint32_t	CH3_AL2_TRANS_COUNT;
	volatile	uint32_t	CH3_AL2_READ_ADDR;
	volatile	uint32_t	CH3_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH3_AL3_CTRL;
	volatile	uint32_t	CH3_AL3_WRITE_ADDR;
	volatile	uint32_t	CH3_AL3_TRANS_COUNT;
	volatile	uint32_t	CH3_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH4_READ_ADDR;
	volatile	uint32_t	CH4_WRITE_ADDR;
	volatile	uint32_t	CH4_TRANS_COUNT;
	volatile	uint32_t	CH4_CTRL_TRIG;
	volatile	uint32_t	CH4_AL1_CTRL;
	volatile	uint32_t	CH4_AL1_READ_ADDR;
	volatile	uint32_t	CH4_AL1_WRITE_ADDR;
	volatile	uint32_t	CH4_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH4_AL2_CTRL;
	volatile	uint32_t	CH4_AL2_TRANS_COUNT;
	volatile	uint32_t	CH4_AL2_READ_ADDR;
	volatile	uint32_t	CH4_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH4_AL3_CTRL;
	volatile	uint32_t	CH4_AL3_WRITE_ADDR;
	volatile	uint32_t	CH4_AL3_TRANS_COUNT;
	volatile	uint32_t	CH4_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH5_READ_ADDR;
	volatile	uint32_t	CH5_WRITE_ADDR;
	volatile	uint32_t	CH5_TRANS_COUNT;
	volatile	uint32_t	CH5_CTRL_TRIG;
	volatile	uint32_t	CH5_AL1_CTRL;
	volatile	uint32_t	CH5_AL1_READ_ADDR;
	volatile	uint32_t	CH5_AL1_WRITE_ADDR;
	volatile	uint32_t	CH5_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH5_AL2_CTRL;
	volatile	uint32_t	CH5_AL2_TRANS_COUNT;
	volatile	uint32_t	CH5_AL2_READ_ADDR;
	volatile	uint32_t	CH5_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH5_AL3_CTRL;
	volatile	uint32_t	CH5_AL3_WRITE_ADDR;
	volatile	uint32_t	CH5_AL3_TRANS_COUNT;
	volatile	uint32_t	CH5_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH6_READ_ADDR;
	volatile	uint32_t	CH6_WRITE_ADDR;
	volatile	uint32_t	CH6_TRANS_COUNT;
	volatile	uint32_t	CH6_CTRL_TRIG;
	volatile	uint32_t	CH6_AL1_CTRL;
	volatile	uint32_t	CH6_AL1_READ_ADDR;
	volatile	uint32_t	CH6_AL1_WRITE_ADDR;
	volatile	uint32_t	CH6_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH6_AL2_CTRL;
	volatile	uint32_t	CH6_AL2_TRANS_COUNT;
	volatile	uint32_t	CH6_AL2_READ_ADDR;
	volatile	uint32_t	CH6_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH6_AL3_CTRL;
	volatile	uint32_t	CH6_AL3_WRITE_ADDR;
	volatile	uint32_t	CH6_AL3_TRANS_COUNT;
	volatile	uint32_t	CH6_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH7_READ_ADDR;
	volatile	uint32_t	CH7_WRITE_ADDR;
	volatile	uint32_t	CH7_TRANS_COUNT;
	volatile	uint32_t	CH7_CTRL_TRIG;
	volatile	uint32_t	CH7_AL1_CTRL;
	volatile	uint32_t	CH7_AL1_READ_ADDR;
	volatile	uint32_t	CH7_AL1_WRITE_ADDR;
	volatile	uint32_t	CH7_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH7_AL2_CTRL;
	volatile	uint32_t	CH7_AL2_TRANS_COUNT;
	volatile	uint32_t	CH7_AL2_READ_ADDR;
	volatile	uint32_t	CH7_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH7_AL3_CTRL;
	volatile	uint32_t	CH7_AL3_WRITE_ADDR;
	volatile	uint32_t	CH7_AL3_TRANS_COUNT;
	volatile	uint32_t	CH7_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH8_READ_ADDR;
	volatile	uint32_t	CH8_WRITE_ADDR;
	volatile	uint32_t	CH8_TRANS_COUNT;
	volatile	uint32_t	CH8_CTRL_TRIG;
	volatile	uint32_t	CH8_AL1_CTRL;
	volatile	uint32_t	CH8_AL1_READ_ADDR;
	volatile	uint32_t	CH8_AL1_WRITE_ADDR;
	volatile	uint32_t	CH8_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH8_AL2_CTRL;
	volatile	uint32_t	CH8_AL2_TRANS_COUNT;
	volatile	uint32_t	CH8_AL2_READ_ADDR;
	volatile	uint32_t	CH8_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH8_AL3_CTRL;
	volatile	uint32_t	CH8_AL3_WRITE_ADDR;
	volatile	uint32_t	CH8_AL3_TRANS_COUNT;
	volatile	uint32_t	CH8_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH9_READ_ADDR;
	volatile	uint32_t	CH9_WRITE_ADDR;
	volatile	uint32_t	CH9_TRANS_COUNT;
	volatile	uint32_t	CH9_CTRL_TRIG;
	volatile	uint32_t	CH9_AL1_CTRL;
	volatile	uint32_t	CH9_AL1_READ_ADDR;
	volatile	uint32_t	CH9_AL1_WRITE_ADDR;
	volatile	uint32_t	CH9_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH9_AL2_CTRL;
	volatile	uint32_t	CH9_AL2_TRANS_COUNT;
	volatile	uint32_t	CH9_AL2_READ_ADDR;
	volatile	uint32_t	CH9_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH9_AL3_CTRL;
	volatile	uint32_t	CH9_AL3_WRITE_ADDR;
	volatile	uint32_t	CH9_AL3_TRANS_COUNT;
	volatile	uint32_t	CH9_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH10_READ_ADDR;
	volatile	uint32_t	CH10_WRITE_ADDR;
	volatile	uint32_t	CH10_TRANS_COUNT;
	volatile	uint32_t	CH10_CTRL_TRIG;
	volatile	uint32_t	CH10_AL1_CTRL;
	volatile	uint32_t	CH10_AL1_READ_ADDR;
	volatile	uint32_t	CH10_AL1_WRITE_ADDR;
	volatile	uint32_t	CH10_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH10_AL2_CTRL;
	volatile	uint32_t	CH10_AL2_TRANS_COUNT;
	volatile	uint32_t	CH10_AL2_READ_ADDR;
	volatile	uint32_t	CH10_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH10_AL3_CTRL;
	volatile	uint32_t	CH10_AL3_WRITE_ADDR;
	volatile	uint32_t	CH10_AL3_TRANS_COUNT;
	volatile	uint32_t	CH10_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH11_READ_ADDR;
	volatile	uint32_t	CH11_WRITE_ADDR;
	volatile	uint32_t	CH11_TRANS_COUNT;
	volatile	uint32_t	CH11_CTRL_TRIG;
	volatile	uint32_t	CH11_AL1_CTRL;
	volatile	uint32_t	CH11_AL1_READ_ADDR;
	volatile	uint32_t	CH11_AL1_WRITE_ADDR;
	volatile	uint32_t	CH11_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH11_AL2_CTRL;
	volatile	uint32_t	CH11_AL2_TRANS_COUNT;
	volatile	uint32_t	CH11_AL2_READ_ADDR;
	volatile	uint32_t	CH11_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH11_AL3_CTRL;
	volatile	uint32_t	CH11_AL3_WRITE_ADDR;
	volatile	uint32_t	CH11_AL3_TRANS_COUNT;
	volatile	uint32_t	CH11_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH12_READ_ADDR;
	volatile	uint32_t	CH12_WRITE_ADDR;
	volatile	uint32_t	CH12_TRANS_COUNT;
	volatile	uint32_t	CH12_CTRL_TRIG;
	volatile	uint32_t	CH12_AL1_CTRL;
	volatile	uint32_t	CH12_AL1_READ_ADDR;
	volatile	uint32_t	CH12_AL1_WRITE_ADDR;
	volatile	uint32_t	CH12_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH12_AL2_CTRL;
	volatile	uint32_t	CH12_AL2_TRANS_COUNT;
	volatile	uint32_t	CH12_AL2_READ_ADDR;
	volatile	uint32_t	CH12_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH12_AL3_CTRL;
	volatile	uint32_t	CH12_AL3_WRITE_ADDR;
	volatile	uint32_t	CH12_AL3_TRANS_COUNT;
	volatile	uint32_t	CH12_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH13_READ_ADDR;
	volatile	uint32_t	CH13_WRITE_ADDR;
	volatile	uint32_t	CH13_TRANS_COUNT;
	volatile	uint32_t	CH13_CTRL_TRIG;
	volatile	uint32_t	CH13_AL1_CTRL;
	volatile	uint32_t	CH13_AL1_READ_ADDR;
	volatile	uint32_t	CH13_AL1_WRITE_ADDR;
	volatile	uint32_t	CH13_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH13_AL2_CTRL;
	volatile	uint32_t	CH13_AL2_TRANS_COUNT;
	volatile	uint32_t	CH13_AL2_READ_ADDR;
	volatile	uint32_t	CH13_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH13_AL3_CTRL;
	volatile	uint32_t	CH13_AL3_WRITE_ADDR;
	volatile	uint32_t	CH13_AL3_TRANS_COUNT;
	volatile	uint32_t	CH13_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH14_READ_ADDR;
	volatile	uint32_t	CH14_WRITE_ADDR;
	volatile	uint32_t	CH14_TRANS_COUNT;
	volatile	uint32_t	CH14_CTRL_TRIG;
	volatile	uint32_t	CH14_AL1_CTRL;
	volatile	uint32_t	CH14_AL1_READ_ADDR;
	volatile	uint32_t	CH14_AL1_WRITE_ADDR;
	volatile	uint32_t	CH14_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH14_AL2_CTRL;
	volatile	uint32_t	CH14_AL2_TRANS_COUNT;
	volatile	uint32_t	CH14_AL2_READ_ADDR;
	volatile	uint32_t	CH14_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH14_AL3_CTRL;
	volatile	uint32_t	CH14_AL3_WRITE_ADDR;
	volatile	uint32_t	CH14_AL3_TRANS_COUNT;
	volatile	uint32_t	CH14_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	CH15_READ_ADDR;
	volatile	uint32_t	CH15_WRITE_ADDR;
	volatile	uint32_t	CH15_TRANS_COUNT;
	volatile	uint32_t	CH15_CTRL_TRIG;
	volatile	uint32_t	CH15_AL1_CTRL;
	volatile	uint32_t	CH15_AL1_READ_ADDR;
	volatile	uint32_t	CH15_AL1_WRITE_ADDR;
	volatile	uint32_t	CH15_AL1_TRANS_COUNT_TRIG;
	volatile	uint32_t	CH15_AL2_CTRL;
	volatile	uint32_t	CH15_AL2_TRANS_COUNT;
	volatile	uint32_t	CH15_AL2_READ_ADDR;
	volatile	uint32_t	CH15_AL2_WRITE_ADDR_TRIG;
	volatile	uint32_t	CH15_AL3_CTRL;
	volatile	uint32_t	CH15_AL3_WRITE_ADDR;
	volatile	uint32_t	CH15_AL3_TRANS_COUNT;
	volatile	uint32_t	CH15_AL3_READ_ADDR_TRIG;
	volatile	uint32_t	INTR;
	volatile	uint32_t	INTE0;
	volatile	uint32_t	INTF0;
	volatile	uint32_t	INTS0;
	volatile	uint32_t	INTR1;
	volatile	uint32_t	INTE1;
	volatile	uint32_t	INTF1;
	volatile	uint32_t	INTS1;
	volatile	uint32_t	INTR2;
	volatile	uint32_t	INTE2;
	volatile	uint32_t	INTF2;
	volatile	uint32_t	INTS2;
	volatile	uint32_t	INTR3;
	volatile	uint32_t	INTE3;
	volatile	uint32_t	INTF3;
	volatile	uint32_t	INTS3;
	volatile	uint32_t	TIMER0;
	volatile	uint32_t	TIMER1;
	volatile	uint32_t	TIMER2;
	volatile	uint32_t	TIMER3;
	volatile	uint32_t	MULTI_CHAN_TRIGGER;
	volatile	uint32_t	SNIFF_CTRL;
	volatile	uint32_t	SNIFF_DATA;
	volatile	uint32_t	RESERVED0;
	volatile	uint32_t	FIFO_LEVELS;
	volatile	uint32_t	CHAN_ABORT;
	volatile	uint32_t	N_CHANNELS;
	volatile	uint32_t	RESERVED1[5];
	volatile	uint32_t	SECCFG_CH0;
	volatile	uint32_t	SECCFG_CH1;
	volatile	uint32_t	SECCFG_CH2;
	volatile	uint32_t	SECCFG_CH3;
	volatile	uint32_t	SECCFG_CH4;
	volatile	uint32_t	SECCFG_CH5;
	volatile	uint32_t	SECCFG_CH6;
	volatile	uint32_t	SECCFG_CH7;
	volatile	uint32_t	SECCFG_CH8;
	volatile	uint32_t	SECCFG_CH9;
	volatile	uint32_t	SECCFG_CH10;
	volatile	uint32_t	SECCFG_CH11;
	volatile	uint32_t	SECCFG_CH12;
	volatile	uint32_t	SECCFG_CH13;
	volatile	uint32_t	SECCFG_CH14;
	volatile	uint32_t	SECCFG_CH15;
	volatile	uint32_t	SECCFG_IRQ0;
	volatile	uint32_t	SECCFG_IRQ1;
	volatile	uint32_t	SECCFG_IRQ2;
	volatile	uint32_t	SECCFG_IRQ3;
	volatile	uint32_t	SECCFG_MISC;
	volatile	uint32_t	RESERVED2[11];
	volatile	uint32_t	MPU_CTRL;
	volatile	uint32_t	MPU_BAR0;
	volatile	uint32_t	MPU_LAR0;
	volatile	uint32_t	MPU_BAR1;
	volatile	uint32_t	MPU_LAR1;
	volatile	uint32_t	MPU_BAR2;
	volatile	uint32_t	MPU_LAR2;
	volatile	uint32_t	MPU_BAR3;
	volatile	uint32_t	MPU_LAR3;
	volatile	uint32_t	MPU_BAR4;
	volatile	uint32_t	MPU_LAR4;
	volatile	uint32_t	MPU_BAR5;
	volatile	uint32_t	MPU_LAR5;
	volatile	uint32_t	MPU_BAR6;
	volatile	uint32_t	MPU_LAR6;
	volatile	uint32_t	MPU_BAR7;
	volatile	uint32_t	MPU_LAR7;
	volatile	uint32_t	RESERVED3[175];
	volatile	uint32_t	CH0_DBG_CTDREQ;
	volatile	uint32_t	CH0_DBG_TCR;
	volatile	uint32_t	RESERVED4[14];
	volatile	uint32_t	CH1_DBG_CTDREQ;
	volatile	uint32_t	CH1_DBG_TCR;
	volatile	uint32_t	RESERVED5[14];
	volatile	uint32_t	CH2_DBG_CTDREQ;
	volatile	uint32_t	CH2_DBG_TCR;
	volatile	uint32_t	RESERVED6[14];
	volatile	uint32_t	CH3_DBG_CTDREQ;
	volatile	uint32_t	CH3_DBG_TCR;
	volatile	uint32_t	RESERVED7[14];
	volatile	uint32_t	CH4_DBG_CTDREQ;
	volatile	uint32_t	CH4_DBG_TCR;
	volatile	uint32_t	RESERVED8[14];
	volatile	uint32_t	CH5_DBG_CTDREQ;
	volatile	uint32_t	CH5_DBG_TCR;
	volatile	uint32_t	RESERVED9[14];
	volatile	uint32_t	CH6_DBG_CTDREQ;
	volatile	uint32_t	CH6_DBG_TCR;
	volatile	uint32_t	RESERVED10[14];
	volatile	uint32_t	CH7_DBG_CTDREQ;
	volatile	uint32_t	CH7_DBG_TCR;
	volatile	uint32_t	RESERVED11[14];
	volatile	uint32_t	CH8_DBG_CTDREQ;
	volatile	uint32_t	CH8_DBG_TCR;
	volatile	uint32_t	RESERVED12[14];
	volatile	uint32_t	CH9_DBG_CTDREQ;
	volatile	uint32_t	CH9_DBG_TCR;
	volatile	uint32_t	RESERVED13[14];
	volatile	uint32_t	CH10_DBG_CTDREQ;
	volatile	uint32_t	CH10_DBG_TCR;
	volatile	uint32_t	RESERVED14[14];
	volatile	uint32_t	CH11_DBG_CTDREQ;
	volatile	uint32_t	CH11_DBG_TCR;
	volatile	uint32_t	RESERVED15[14];
	volatile	uint32_t	CH12_DBG_CTDREQ;
	volatile	uint32_t	CH12_DBG_TCR;
	volatile	uint32_t	RESERVED16[14];
	volatile	uint32_t	CH13_DBG_CTDREQ;
	volatile	uint32_t	CH13_DBG_TCR;
	volatile	uint32_t	RESERVED17[14];
	volatile	uint32_t	CH14_DBG_CTDREQ;
	volatile	uint32_t	CH14_DBG_TCR;
	volatile	uint32_t	RESERVED18[14];
	volatile	uint32_t	CH15_DBG_CTDREQ;
	volatile	uint32_t	CH15_DBG_TCR;
} DMA_TypeDef;

#ifdef __cplusplus
#define	DMA_NS	reinterpret_cast<DMA_TypeDef *>(0x50000000u)
#define	DMA_S	reinterpret_cast<DMA_TypeDef *>(0x50000000u)
#else
#define	DMA_NS	((DMA_TypeDef *)0x50000000u)
#define	DMA_S	((DMA_TypeDef *)0x50000000u)
#endif

