Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_dma.h
#define	DMA_CH4_AL1_READ_ADDR_CH4_AL1_READ_ADDR						(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL1_READ_ADDR_CH4_AL1_READ_ADDR_0					(0x1u<<0)

// CH4_AL1_WRITE_ADDR Configuration

#define	DMA_CH4_AL1_WRITE_ADDR_CH4_AL1_WRITE_ADDR					(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL1_WRITE_ADDR_CH4_AL1_WRITE_ADDR_0					(0x1u<<0)

// CH4_AL1_TRANS_COUNT_TRIG Configuration

#define	DMA_CH4_AL1_TRANS_COUNT_TRIG_CH4_AL1_TRANS_COUNT_TRIG		(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL1_TRANS_COUNT_TRIG_CH4_AL1_TRANS_COUNT_TRIG_0		(0x1u<<0)

// CH4_AL2_CTRL Configuration

#define	DMA_CH4_AL2_CTRL_CH4_AL2_CTRL								(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL2_CTRL_CH4_AL2_CTRL_0								(0x1u<<0)

// CH4_AL2_TRANS_COUNT Configuration

#define	DMA_CH4_AL2_TRANS_COUNT_CH4_AL2_TRANS_COUNT					(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL2_TRANS_COUNT_CH4_AL2_TRANS_COUNT_0				(0x1u<<0)

// CH4_AL2_READ_ADDR Configuration

#define	DMA_CH4_AL2_READ_ADDR_CH4_AL2_READ_ADDR						(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL2_READ_ADDR_CH4_AL2_READ_ADDR_0					(0x1u<<0)

// CH4_AL2_WRITE_ADDR_TRIG Configuration

#define	DMA_CH4_AL2_WRITE_ADDR_TRIG_CH4_AL2_WRITE_ADDR_TRIG			(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL2_WRITE_ADDR_TRIG_CH4_AL2_WRITE_ADDR_TRIG_0		(0x1u<<0)

// CH4_AL3_CTRL Configuration

#define	DMA_CH4_AL3_CTRL_CH4_AL3_CTRL								(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL3_CTRL_CH4_AL3_CTRL_0								(0x1u<<0)

// CH4_AL3_WRITE_ADDR Configuration

#define	DMA_CH4_AL3_WRITE_ADDR_CH4_AL3_WRITE_ADDR					(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL3_WRITE_ADDR_CH4_AL3_WRITE_ADDR_0					(0x1u<<0)

// CH4_AL3_TRANS_COUNT Configuration

#define	DMA_CH4_AL3_TRANS_COUNT_CH4_AL3_TRANS_COUNT					(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL3_TRANS_COUNT_CH4_AL3_TRANS_COUNT_0				(0x1u<<0)

// CH4_AL3_READ_ADDR_TRIG Configuration

#define	DMA_CH4_AL3_READ_ADDR_TRIG_CH4_AL3_READ_ADDR_TRIG			(0xFFFFFFFFu<<0)
#define	DMA_CH4_AL3_READ_ADDR_TRIG_CH4_AL3_READ_ADDR_TRIG_0			(0x1u<<0)

// CH5_READ_ADDR Configuration

#define	DMA_CH5_READ_ADDR_CH5_READ_ADDR								(0xFFFFFFFFu<<0)
#define	DMA_CH5_READ_ADDR_CH5_READ_ADDR_0							(0x1u<<0)

// CH5_WRITE_ADDR Configuration

#define	DMA_CH5_WRITE_ADDR_CH5_WRITE_ADDR							(0xFFFFFFFFu<<0)
#define	DMA_CH5_WRITE_ADDR_CH5_WRITE_ADDR_0							(0x1u<<0)

// CH5_TRANS_COUNT Configuration

#define	DMA_CH5_TRANS_COUNT_COUNT									(0xFFFFFFFu<<0)
#define	DMA_CH5_TRANS_COUNT_COUNT_0									(0x1u<<0)
#define	DMA_CH5_TRANS_COUNT_MODE									(0xFu<<28)
#define	DMA_CH5_TRANS_COUNT_MODE_0									(0x1u<<28)
#define	DMA_CH5_TRANS_COUNT_MODE_NORMAL								(0x0u<<28)
#define	DMA_CH5_TRANS_COUNT_MODE_TRIGGER_SELF						(0x1u<<28)
#define	DMA_CH5_TRANS_COUNT_MODE_ENDLESS							(0xFu<<28)

// CH5_CTRL_TRIG Configuration

#define	DMA_CH5_CTRL_TRIG_EN										(0x1u<<0)
#define	DMA_CH5_CTRL_TRIG_HIGH_PRIORITY								(0x1u<<1)
#define	DMA_CH5_CTRL_TRIG_DATA_SIZE									(0x3u<<2)
#define	DMA_CH5_CTRL_TRIG_DATA_SIZE_0								(0x1u<<2)
#define	DMA_CH5_CTRL_TRIG_INCR_READ									(0x1u<<4)
#define	DMA_CH5_CTRL_TRIG_INCR_READ_REV								(0x1u<<5)
#define	DMA_CH5_CTRL_TRIG_INCR_WRITE								(0x1u<<6)
#define	DMA_CH5_CTRL_TRIG_INCR_WRITE_REV							(0x1u<<7)
#define	DMA_CH5_CTRL_TRIG_RING_SIZE									(0xFu<<8)
#define	DMA_CH5_CTRL_TRIG_RING_SIZE_0								(0x1u<<8)
#define	DMA_CH5_CTRL_TRIG_RING_SEL									(0x1u<<12)
#define	DMA_CH5_CTRL_TRIG_CHAIN_TO									(0xFu<<13)
#define	DMA_CH5_CTRL_TRIG_CHAIN_TO_0								(0x1u<<13)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL									(0x3Fu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_0								(0x1u<<17)
#define	DMA_CH5_CTRL_TRIG_IRQ_QUIET									(0x1u<<23)
#define	DMA_CH5_CTRL_TRIG_BSWAP										(0x1u<<24)
#define	DMA_CH5_CTRL_TRIG_SNIFF_EN									(0x1u<<25)
#define	DMA_CH5_CTRL_TRIG_BUSY										(0x1u<<26)
#define	DMA_CH5_CTRL_TRIG_WRITE_ERROR								(0x1u<<29)
#define	DMA_CH5_CTRL_TRIG_READ_ERROR								(0x1u<<30)
#define	DMA_CH5_CTRL_TRIG_AHB_ERROR									(0x1u<<31)
#define	DMA_CH5_CTRL_TRIG_DATA_SIZE_SIZE_BYTE						(0x0u<<2)
#define	DMA_CH5_CTRL_TRIG_DATA_SIZE_SIZE_HALFWORD					(0x1u<<2)
#define	DMA_CH5_CTRL_TRIG_DATA_SIZE_SIZE_WORD						(0x2u<<2)
#define	DMA_CH5_CTRL_TRIG_RING_SIZE_RING_NONE						(0x0u<<8)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO0_TX0							(0x0u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO0_TX1							(0x1u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO0_TX2							(0x2u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO0_TX3							(0x3u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO0_RX0							(0x4u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO0_RX1							(0x5u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO0_RX2							(0x6u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO0_RX3							(0x7u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO1_TX0							(0x8u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO1_TX1							(0x9u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO1_TX2							(0xAu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO1_TX3							(0xBu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO1_RX0							(0xCu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO1_RX1							(0xDu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO1_RX2							(0xEu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO1_RX3							(0xFu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO2_TX0							(0x10u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO2_TX1							(0x11u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO2_TX2							(0x12u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO2_TX3							(0x13u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO2_RX0							(0x14u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO2_RX1							(0x15u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO2_RX2							(0x16u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PIO2_RX3							(0x17u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_SPI0_TX							(0x18u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_SPI0_RX							(0x19u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_SPI1_TX							(0x1Au<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_SPI1_RX							(0x1Bu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_UART0_TX							(0x1Cu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_UART0_RX							(0x1Du<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_UART1_TX							(0x1Eu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_UART1_RX							(0x1Fu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP0						(0x20u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP1						(0x21u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP2						(0x22u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP3						(0x23u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP4						(0x24u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP5						(0x25u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP6						(0x26u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP7						(0x27u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP8						(0x28u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP9						(0x29u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP10						(0x2Au<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PWM_WRAP11						(0x2Bu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_I2C0_TX							(0x2Cu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_I2C0_RX							(0x2Du<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_I2C1_TX							(0x2Eu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_I2C1_RX							(0x2Fu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_ADC								(0x30u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_XIP_STREAM						(0x31u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_XIP_QMITX						(0x32u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_XIP_QMIRX						(0x33u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_HSTX								(0x34u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_CORESIGHT						(0x35u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_SHA256							(0x36u<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_TIMER0							(0x3Bu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_TIMER1							(0x3Cu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_TIMER2							(0x3Du<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_TIMER3							(0x3Eu<<17)
#define	DMA_CH5_CTRL_TRIG_TREQ_SEL_PERMANENT						(0x3Fu<<17)

