Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_dma.h
#define	DMA_CH15_AL1_READ_ADDR_CH15_AL1_READ_ADDR					(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL1_READ_ADDR_CH15_AL1_READ_ADDR_0					(0x1u<<0)

// CH15_AL1_WRITE_ADDR Configuration

#define	DMA_CH15_AL1_WRITE_ADDR_CH15_AL1_WRITE_ADDR					(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL1_WRITE_ADDR_CH15_AL1_WRITE_ADDR_0				(0x1u<<0)

// CH15_AL1_TRANS_COUNT_TRIG Configuration

#define	DMA_CH15_AL1_TRANS_COUNT_TRIG_CH15_AL1_TRANS_COUNT_TRIG		(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL1_TRANS_COUNT_TRIG_CH15_AL1_TRANS_COUNT_TRIG_0	(0x1u<<0)

// CH15_AL2_CTRL Configuration

#define	DMA_CH15_AL2_CTRL_CH15_AL2_CTRL								(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL2_CTRL_CH15_AL2_CTRL_0							(0x1u<<0)

// CH15_AL2_TRANS_COUNT Configuration

#define	DMA_CH15_AL2_TRANS_COUNT_CH15_AL2_TRANS_COUNT				(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL2_TRANS_COUNT_CH15_AL2_TRANS_COUNT_0				(0x1u<<0)

// CH15_AL2_READ_ADDR Configuration

#define	DMA_CH15_AL2_READ_ADDR_CH15_AL2_READ_ADDR					(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL2_READ_ADDR_CH15_AL2_READ_ADDR_0					(0x1u<<0)

// CH15_AL2_WRITE_ADDR_TRIG Configuration

#define	DMA_CH15_AL2_WRITE_ADDR_TRIG_CH15_AL2_WRITE_ADDR_TRIG		(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL2_WRITE_ADDR_TRIG_CH15_AL2_WRITE_ADDR_TRIG_0		(0x1u<<0)

// CH15_AL3_CTRL Configuration

#define	DMA_CH15_AL3_CTRL_CH15_AL3_CTRL								(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL3_CTRL_CH15_AL3_CTRL_0							(0x1u<<0)

// CH15_AL3_WRITE_ADDR Configuration

#define	DMA_CH15_AL3_WRITE_ADDR_CH15_AL3_WRITE_ADDR					(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL3_WRITE_ADDR_CH15_AL3_WRITE_ADDR_0				(0x1u<<0)

// CH15_AL3_TRANS_COUNT Configuration

#define	DMA_CH15_AL3_TRANS_COUNT_CH15_AL3_TRANS_COUNT				(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL3_TRANS_COUNT_CH15_AL3_TRANS_COUNT_0				(0x1u<<0)

// CH15_AL3_READ_ADDR_TRIG Configuration

#define	DMA_CH15_AL3_READ_ADDR_TRIG_CH15_AL3_READ_ADDR_TRIG			(0xFFFFFFFFu<<0)
#define	DMA_CH15_AL3_READ_ADDR_TRIG_CH15_AL3_READ_ADDR_TRIG_0		(0x1u<<0)

// INTR Configuration

#define	DMA_INTR_INTR												(0xFFFFu<<0)
#define	DMA_INTR_INTR_0												(0x1u<<0)

// INTE0 Configuration

#define	DMA_INTE0_INTE0												(0xFFFFu<<0)
#define	DMA_INTE0_INTE0_0											(0x1u<<0)

// INTF0 Configuration

#define	DMA_INTF0_INTF0												(0xFFFFu<<0)
#define	DMA_INTF0_INTF0_0											(0x1u<<0)

// INTS0 Configuration

#define	DMA_INTS0_INTS0												(0xFFFFu<<0)
#define	DMA_INTS0_INTS0_0											(0x1u<<0)

// INTR1 Configuration

#define	DMA_INTR1_INTR1												(0xFFFFu<<0)
#define	DMA_INTR1_INTR1_0											(0x1u<<0)

// INTE1 Configuration

#define	DMA_INTE1_INTE1												(0xFFFFu<<0)
#define	DMA_INTE1_INTE1_0											(0x1u<<0)

// INTF1 Configuration

#define	DMA_INTF1_INTF1												(0xFFFFu<<0)
#define	DMA_INTF1_INTF1_0											(0x1u<<0)

// INTS1 Configuration

#define	DMA_INTS1_INTS1												(0xFFFFu<<0)
#define	DMA_INTS1_INTS1_0											(0x1u<<0)

// INTR2 Configuration

#define	DMA_INTR2_INTR2												(0xFFFFu<<0)
#define	DMA_INTR2_INTR2_0											(0x1u<<0)

// INTE2 Configuration

#define	DMA_INTE2_INTE2												(0xFFFFu<<0)
#define	DMA_INTE2_INTE2_0											(0x1u<<0)

// INTF2 Configuration

#define	DMA_INTF2_INTF2												(0xFFFFu<<0)
#define	DMA_INTF2_INTF2_0											(0x1u<<0)

// INTS2 Configuration

#define	DMA_INTS2_INTS2												(0xFFFFu<<0)
#define	DMA_INTS2_INTS2_0											(0x1u<<0)

// INTR3 Configuration

#define	DMA_INTR3_INTR3												(0xFFFFu<<0)
#define	DMA_INTR3_INTR3_0											(0x1u<<0)

// INTE3 Configuration

#define	DMA_INTE3_INTE3												(0xFFFFu<<0)
#define	DMA_INTE3_INTE3_0											(0x1u<<0)

// INTF3 Configuration

#define	DMA_INTF3_INTF3												(0xFFFFu<<0)
#define	DMA_INTF3_INTF3_0											(0x1u<<0)

// INTS3 Configuration

#define	DMA_INTS3_INTS3												(0xFFFFu<<0)
#define	DMA_INTS3_INTS3_0											(0x1u<<0)

// TIMER0 Configuration

#define	DMA_TIMER0_Y												(0xFFFFu<<0)
#define	DMA_TIMER0_Y_0												(0x1u<<0)
#define	DMA_TIMER0_X												(0xFFFFu<<16)
#define	DMA_TIMER0_X_0												(0x1u<<16)

// TIMER1 Configuration

#define	DMA_TIMER1_Y												(0xFFFFu<<0)
#define	DMA_TIMER1_Y_0												(0x1u<<0)
#define	DMA_TIMER1_X												(0xFFFFu<<16)
#define	DMA_TIMER1_X_0												(0x1u<<16)

// TIMER2 Configuration

#define	DMA_TIMER2_Y												(0xFFFFu<<0)
#define	DMA_TIMER2_Y_0												(0x1u<<0)
#define	DMA_TIMER2_X												(0xFFFFu<<16)
#define	DMA_TIMER2_X_0												(0x1u<<16)

// TIMER3 Configuration

#define	DMA_TIMER3_Y												(0xFFFFu<<0)
#define	DMA_TIMER3_Y_0												(0x1u<<0)
#define	DMA_TIMER3_X												(0xFFFFu<<16)
#define	DMA_TIMER3_X_0												(0x1u<<16)

// MULTI_CHAN_TRIGGER Configuration

#define	DMA_MULTI_CHAN_TRIGGER_MULTI_CHAN_TRIGGER					(0xFFFFu<<0)
#define	DMA_MULTI_CHAN_TRIGGER_MULTI_CHAN_TRIGGER_0					(0x1u<<0)

// SNIFF_CTRL Configuration

#define	DMA_SNIFF_CTRL_EN											(0x1u<<0)
#define	DMA_SNIFF_CTRL_DMACH										(0xFu<<1)
#define	DMA_SNIFF_CTRL_DMACH_0										(0x1u<<1)
#define	DMA_SNIFF_CTRL_CALC											(0xFu<<5)
#define	DMA_SNIFF_CTRL_CALC_0										(0x1u<<5)
#define	DMA_SNIFF_CTRL_BSWAP										(0x1u<<9)
#define	DMA_SNIFF_CTRL_OUT_REV										(0x1u<<10)
#define	DMA_SNIFF_CTRL_OUT_INV										(0x1u<<11)
#define	DMA_SNIFF_CTRL_CALC_CRC32									(0x0u<<5)
#define	DMA_SNIFF_CTRL_CALC_CRC32R									(0x1u<<5)
#define	DMA_SNIFF_CTRL_CALC_CRC16									(0x2u<<5)
#define	DMA_SNIFF_CTRL_CALC_CRC16R									(0x3u<<5)
#define	DMA_SNIFF_CTRL_CALC_EVEN									(0xEu<<5)
#define	DMA_SNIFF_CTRL_CALC_SUM										(0xFu<<5)

// SNIFF_DATA Configuration

#define	DMA_SNIFF_DATA_SNIFF_DATA									(0xFFFFFFFFu<<0)
#define	DMA_SNIFF_DATA_SNIFF_DATA_0									(0x1u<<0)

// FIFO_LEVELS Configuration

#define	DMA_FIFO_LEVELS_TDF_LVL										(0xFFu<<0)
#define	DMA_FIFO_LEVELS_TDF_LVL_0									(0x1u<<0)
#define	DMA_FIFO_LEVELS_WAF_LVL										(0xFFu<<8)
#define	DMA_FIFO_LEVELS_WAF_LVL_0									(0x1u<<8)
#define	DMA_FIFO_LEVELS_RAF_LVL										(0xFFu<<16)
#define	DMA_FIFO_LEVELS_RAF_LVL_0									(0x1u<<16)

// CHAN_ABORT Configuration

#define	DMA_CHAN_ABORT_CHAN_ABORT									(0xFFFFu<<0)
#define	DMA_CHAN_ABORT_CHAN_ABORT_0									(0x1u<<0)

// N_CHANNELS Configuration

#define	DMA_N_CHANNELS_N_CHANNELS									(0x1Fu<<0)
#define	DMA_N_CHANNELS_N_CHANNELS_0									(0x1u<<0)

