Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_dma.h
// SECCFG_CH0 Configuration

#define	DMA_SECCFG_CH0_P											(0x1u<<0)
#define	DMA_SECCFG_CH0_S											(0x1u<<1)
#define	DMA_SECCFG_CH0_LOCK											(0x1u<<2)

// SECCFG_CH1 Configuration

#define	DMA_SECCFG_CH1_P											(0x1u<<0)
#define	DMA_SECCFG_CH1_S											(0x1u<<1)
#define	DMA_SECCFG_CH1_LOCK											(0x1u<<2)

// SECCFG_CH2 Configuration

#define	DMA_SECCFG_CH2_P											(0x1u<<0)
#define	DMA_SECCFG_CH2_S											(0x1u<<1)
#define	DMA_SECCFG_CH2_LOCK											(0x1u<<2)

// SECCFG_CH3 Configuration

#define	DMA_SECCFG_CH3_P											(0x1u<<0)
#define	DMA_SECCFG_CH3_S											(0x1u<<1)
#define	DMA_SECCFG_CH3_LOCK											(0x1u<<2)

// SECCFG_CH4 Configuration

#define	DMA_SECCFG_CH4_P											(0x1u<<0)
#define	DMA_SECCFG_CH4_S											(0x1u<<1)
#define	DMA_SECCFG_CH4_LOCK											(0x1u<<2)

// SECCFG_CH5 Configuration

#define	DMA_SECCFG_CH5_P											(0x1u<<0)
#define	DMA_SECCFG_CH5_S											(0x1u<<1)
#define	DMA_SECCFG_CH5_LOCK											(0x1u<<2)

// SECCFG_CH6 Configuration

#define	DMA_SECCFG_CH6_P											(0x1u<<0)
#define	DMA_SECCFG_CH6_S											(0x1u<<1)
#define	DMA_SECCFG_CH6_LOCK											(0x1u<<2)

// SECCFG_CH7 Configuration

#define	DMA_SECCFG_CH7_P											(0x1u<<0)
#define	DMA_SECCFG_CH7_S											(0x1u<<1)
#define	DMA_SECCFG_CH7_LOCK											(0x1u<<2)

// SECCFG_CH8 Configuration

#define	DMA_SECCFG_CH8_P											(0x1u<<0)
#define	DMA_SECCFG_CH8_S											(0x1u<<1)
#define	DMA_SECCFG_CH8_LOCK											(0x1u<<2)

// SECCFG_CH9 Configuration

#define	DMA_SECCFG_CH9_P											(0x1u<<0)
#define	DMA_SECCFG_CH9_S											(0x1u<<1)
#define	DMA_SECCFG_CH9_LOCK											(0x1u<<2)

// SECCFG_CH10 Configuration

#define	DMA_SECCFG_CH10_P											(0x1u<<0)
#define	DMA_SECCFG_CH10_S											(0x1u<<1)
#define	DMA_SECCFG_CH10_LOCK										(0x1u<<2)

// SECCFG_CH11 Configuration

#define	DMA_SECCFG_CH11_P											(0x1u<<0)
#define	DMA_SECCFG_CH11_S											(0x1u<<1)
#define	DMA_SECCFG_CH11_LOCK										(0x1u<<2)

// SECCFG_CH12 Configuration

#define	DMA_SECCFG_CH12_P											(0x1u<<0)
#define	DMA_SECCFG_CH12_S											(0x1u<<1)
#define	DMA_SECCFG_CH12_LOCK										(0x1u<<2)

// SECCFG_CH13 Configuration

#define	DMA_SECCFG_CH13_P											(0x1u<<0)
#define	DMA_SECCFG_CH13_S											(0x1u<<1)
#define	DMA_SECCFG_CH13_LOCK										(0x1u<<2)

// SECCFG_CH14 Configuration

#define	DMA_SECCFG_CH14_P											(0x1u<<0)
#define	DMA_SECCFG_CH14_S											(0x1u<<1)
#define	DMA_SECCFG_CH14_LOCK										(0x1u<<2)

// SECCFG_CH15 Configuration

#define	DMA_SECCFG_CH15_P											(0x1u<<0)
#define	DMA_SECCFG_CH15_S											(0x1u<<1)
#define	DMA_SECCFG_CH15_LOCK										(0x1u<<2)

// SECCFG_IRQ0 Configuration

#define	DMA_SECCFG_IRQ0_P											(0x1u<<0)
#define	DMA_SECCFG_IRQ0_S											(0x1u<<1)

// SECCFG_IRQ1 Configuration

#define	DMA_SECCFG_IRQ1_P											(0x1u<<0)
#define	DMA_SECCFG_IRQ1_S											(0x1u<<1)

// SECCFG_IRQ2 Configuration

#define	DMA_SECCFG_IRQ2_P											(0x1u<<0)
#define	DMA_SECCFG_IRQ2_S											(0x1u<<1)

// SECCFG_IRQ3 Configuration

#define	DMA_SECCFG_IRQ3_P											(0x1u<<0)
#define	DMA_SECCFG_IRQ3_S											(0x1u<<1)

// SECCFG_MISC Configuration

#define	DMA_SECCFG_MISC_SNIFF_P										(0x1u<<0)
#define	DMA_SECCFG_MISC_SNIFF_S										(0x1u<<1)
#define	DMA_SECCFG_MISC_TIMER0_P									(0x1u<<2)
#define	DMA_SECCFG_MISC_TIMER0_S									(0x1u<<3)
#define	DMA_SECCFG_MISC_TIMER1_P									(0x1u<<4)
#define	DMA_SECCFG_MISC_TIMER1_S									(0x1u<<5)
#define	DMA_SECCFG_MISC_TIMER2_P									(0x1u<<6)
#define	DMA_SECCFG_MISC_TIMER2_S									(0x1u<<7)
#define	DMA_SECCFG_MISC_TIMER3_P									(0x1u<<8)
#define	DMA_SECCFG_MISC_TIMER3_S									(0x1u<<9)

// MPU_CTRL Configuration

#define	DMA_MPU_CTRL_P												(0x1u<<1)
#define	DMA_MPU_CTRL_S												(0x1u<<2)
#define	DMA_MPU_CTRL_NS_HIDE_ADDR									(0x1u<<3)

// MPU_BAR0 Configuration

#define	DMA_MPU_BAR0_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_BAR0_ADDR_0											(0x1u<<5)

// MPU_LAR0 Configuration

#define	DMA_MPU_LAR0_EN												(0x1u<<0)
#define	DMA_MPU_LAR0_P												(0x1u<<1)
#define	DMA_MPU_LAR0_S												(0x1u<<2)
#define	DMA_MPU_LAR0_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_LAR0_ADDR_0											(0x1u<<5)

// MPU_BAR1 Configuration

#define	DMA_MPU_BAR1_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_BAR1_ADDR_0											(0x1u<<5)

// MPU_LAR1 Configuration

#define	DMA_MPU_LAR1_EN												(0x1u<<0)
#define	DMA_MPU_LAR1_P												(0x1u<<1)
#define	DMA_MPU_LAR1_S												(0x1u<<2)
#define	DMA_MPU_LAR1_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_LAR1_ADDR_0											(0x1u<<5)

// MPU_BAR2 Configuration

#define	DMA_MPU_BAR2_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_BAR2_ADDR_0											(0x1u<<5)

// MPU_LAR2 Configuration

#define	DMA_MPU_LAR2_EN												(0x1u<<0)
#define	DMA_MPU_LAR2_P												(0x1u<<1)
#define	DMA_MPU_LAR2_S												(0x1u<<2)
#define	DMA_MPU_LAR2_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_LAR2_ADDR_0											(0x1u<<5)

// MPU_BAR3 Configuration

#define	DMA_MPU_BAR3_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_BAR3_ADDR_0											(0x1u<<5)

// MPU_LAR3 Configuration

#define	DMA_MPU_LAR3_EN												(0x1u<<0)
#define	DMA_MPU_LAR3_P												(0x1u<<1)
#define	DMA_MPU_LAR3_S												(0x1u<<2)
#define	DMA_MPU_LAR3_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_LAR3_ADDR_0											(0x1u<<5)

// MPU_BAR4 Configuration

#define	DMA_MPU_BAR4_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_BAR4_ADDR_0											(0x1u<<5)

// MPU_LAR4 Configuration

#define	DMA_MPU_LAR4_EN												(0x1u<<0)
#define	DMA_MPU_LAR4_P												(0x1u<<1)
#define	DMA_MPU_LAR4_S												(0x1u<<2)
#define	DMA_MPU_LAR4_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_LAR4_ADDR_0											(0x1u<<5)

// MPU_BAR5 Configuration

#define	DMA_MPU_BAR5_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_BAR5_ADDR_0											(0x1u<<5)

// MPU_LAR5 Configuration

#define	DMA_MPU_LAR5_EN												(0x1u<<0)
#define	DMA_MPU_LAR5_P												(0x1u<<1)
#define	DMA_MPU_LAR5_S												(0x1u<<2)
#define	DMA_MPU_LAR5_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_LAR5_ADDR_0											(0x1u<<5)

// MPU_BAR6 Configuration

#define	DMA_MPU_BAR6_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_BAR6_ADDR_0											(0x1u<<5)

