Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/rp2350/Includes/Registers/RP2350_dma.h
// MPU_LAR6 Configuration

#define	DMA_MPU_LAR6_EN												(0x1u<<0)
#define	DMA_MPU_LAR6_P												(0x1u<<1)
#define	DMA_MPU_LAR6_S												(0x1u<<2)
#define	DMA_MPU_LAR6_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_LAR6_ADDR_0											(0x1u<<5)

// MPU_BAR7 Configuration

#define	DMA_MPU_BAR7_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_BAR7_ADDR_0											(0x1u<<5)

// MPU_LAR7 Configuration

#define	DMA_MPU_LAR7_EN												(0x1u<<0)
#define	DMA_MPU_LAR7_P												(0x1u<<1)
#define	DMA_MPU_LAR7_S												(0x1u<<2)
#define	DMA_MPU_LAR7_ADDR											(0x7FFFFFFu<<5)
#define	DMA_MPU_LAR7_ADDR_0											(0x1u<<5)

// CH0_DBG_CTDREQ Configuration

#define	DMA_CH0_DBG_CTDREQ_CH0_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH0_DBG_CTDREQ_CH0_DBG_CTDREQ_0							(0x1u<<0)

// CH0_DBG_TCR Configuration

#define	DMA_CH0_DBG_TCR_CH0_DBG_TCR									(0xFFFFFFFFu<<0)
#define	DMA_CH0_DBG_TCR_CH0_DBG_TCR_0								(0x1u<<0)

// CH1_DBG_CTDREQ Configuration

#define	DMA_CH1_DBG_CTDREQ_CH1_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH1_DBG_CTDREQ_CH1_DBG_CTDREQ_0							(0x1u<<0)

// CH1_DBG_TCR Configuration

#define	DMA_CH1_DBG_TCR_CH1_DBG_TCR									(0xFFFFFFFFu<<0)
#define	DMA_CH1_DBG_TCR_CH1_DBG_TCR_0								(0x1u<<0)

// CH2_DBG_CTDREQ Configuration

#define	DMA_CH2_DBG_CTDREQ_CH2_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH2_DBG_CTDREQ_CH2_DBG_CTDREQ_0							(0x1u<<0)

// CH2_DBG_TCR Configuration

#define	DMA_CH2_DBG_TCR_CH2_DBG_TCR									(0xFFFFFFFFu<<0)
#define	DMA_CH2_DBG_TCR_CH2_DBG_TCR_0								(0x1u<<0)

// CH3_DBG_CTDREQ Configuration

#define	DMA_CH3_DBG_CTDREQ_CH3_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH3_DBG_CTDREQ_CH3_DBG_CTDREQ_0							(0x1u<<0)

// CH3_DBG_TCR Configuration

#define	DMA_CH3_DBG_TCR_CH3_DBG_TCR									(0xFFFFFFFFu<<0)
#define	DMA_CH3_DBG_TCR_CH3_DBG_TCR_0								(0x1u<<0)

// CH4_DBG_CTDREQ Configuration

#define	DMA_CH4_DBG_CTDREQ_CH4_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH4_DBG_CTDREQ_CH4_DBG_CTDREQ_0							(0x1u<<0)

// CH4_DBG_TCR Configuration

#define	DMA_CH4_DBG_TCR_CH4_DBG_TCR									(0xFFFFFFFFu<<0)
#define	DMA_CH4_DBG_TCR_CH4_DBG_TCR_0								(0x1u<<0)

// CH5_DBG_CTDREQ Configuration

#define	DMA_CH5_DBG_CTDREQ_CH5_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH5_DBG_CTDREQ_CH5_DBG_CTDREQ_0							(0x1u<<0)

// CH5_DBG_TCR Configuration

#define	DMA_CH5_DBG_TCR_CH5_DBG_TCR									(0xFFFFFFFFu<<0)
#define	DMA_CH5_DBG_TCR_CH5_DBG_TCR_0								(0x1u<<0)

// CH6_DBG_CTDREQ Configuration

#define	DMA_CH6_DBG_CTDREQ_CH6_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH6_DBG_CTDREQ_CH6_DBG_CTDREQ_0							(0x1u<<0)

// CH6_DBG_TCR Configuration

#define	DMA_CH6_DBG_TCR_CH6_DBG_TCR									(0xFFFFFFFFu<<0)
#define	DMA_CH6_DBG_TCR_CH6_DBG_TCR_0								(0x1u<<0)

// CH7_DBG_CTDREQ Configuration

#define	DMA_CH7_DBG_CTDREQ_CH7_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH7_DBG_CTDREQ_CH7_DBG_CTDREQ_0							(0x1u<<0)

// CH7_DBG_TCR Configuration

#define	DMA_CH7_DBG_TCR_CH7_DBG_TCR									(0xFFFFFFFFu<<0)
#define	DMA_CH7_DBG_TCR_CH7_DBG_TCR_0								(0x1u<<0)

// CH8_DBG_CTDREQ Configuration

#define	DMA_CH8_DBG_CTDREQ_CH8_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH8_DBG_CTDREQ_CH8_DBG_CTDREQ_0							(0x1u<<0)

// CH8_DBG_TCR Configuration

#define	DMA_CH8_DBG_TCR_CH8_DBG_TCR									(0xFFFFFFFFu<<0)
#define	DMA_CH8_DBG_TCR_CH8_DBG_TCR_0								(0x1u<<0)

// CH9_DBG_CTDREQ Configuration

#define	DMA_CH9_DBG_CTDREQ_CH9_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH9_DBG_CTDREQ_CH9_DBG_CTDREQ_0							(0x1u<<0)

// CH9_DBG_TCR Configuration

#define	DMA_CH9_DBG_TCR_CH9_DBG_TCR									(0xFFFFFFFFu<<0)
#define	DMA_CH9_DBG_TCR_CH9_DBG_TCR_0								(0x1u<<0)

// CH10_DBG_CTDREQ Configuration

#define	DMA_CH10_DBG_CTDREQ_CH10_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH10_DBG_CTDREQ_CH10_DBG_CTDREQ_0						(0x1u<<0)

// CH10_DBG_TCR Configuration

#define	DMA_CH10_DBG_TCR_CH10_DBG_TCR								(0xFFFFFFFFu<<0)
#define	DMA_CH10_DBG_TCR_CH10_DBG_TCR_0								(0x1u<<0)

// CH11_DBG_CTDREQ Configuration

#define	DMA_CH11_DBG_CTDREQ_CH11_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH11_DBG_CTDREQ_CH11_DBG_CTDREQ_0						(0x1u<<0)

// CH11_DBG_TCR Configuration

#define	DMA_CH11_DBG_TCR_CH11_DBG_TCR								(0xFFFFFFFFu<<0)
#define	DMA_CH11_DBG_TCR_CH11_DBG_TCR_0								(0x1u<<0)

// CH12_DBG_CTDREQ Configuration

#define	DMA_CH12_DBG_CTDREQ_CH12_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH12_DBG_CTDREQ_CH12_DBG_CTDREQ_0						(0x1u<<0)

// CH12_DBG_TCR Configuration

#define	DMA_CH12_DBG_TCR_CH12_DBG_TCR								(0xFFFFFFFFu<<0)
#define	DMA_CH12_DBG_TCR_CH12_DBG_TCR_0								(0x1u<<0)

// CH13_DBG_CTDREQ Configuration

#define	DMA_CH13_DBG_CTDREQ_CH13_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH13_DBG_CTDREQ_CH13_DBG_CTDREQ_0						(0x1u<<0)

// CH13_DBG_TCR Configuration

#define	DMA_CH13_DBG_TCR_CH13_DBG_TCR								(0xFFFFFFFFu<<0)
#define	DMA_CH13_DBG_TCR_CH13_DBG_TCR_0								(0x1u<<0)

// CH14_DBG_CTDREQ Configuration

#define	DMA_CH14_DBG_CTDREQ_CH14_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH14_DBG_CTDREQ_CH14_DBG_CTDREQ_0						(0x1u<<0)

// CH14_DBG_TCR Configuration

#define	DMA_CH14_DBG_TCR_CH14_DBG_TCR								(0xFFFFFFFFu<<0)
#define	DMA_CH14_DBG_TCR_CH14_DBG_TCR_0								(0x1u<<0)

// CH15_DBG_CTDREQ Configuration

#define	DMA_CH15_DBG_CTDREQ_CH15_DBG_CTDREQ							(0x3Fu<<0)
#define	DMA_CH15_DBG_CTDREQ_CH15_DBG_CTDREQ_0						(0x1u<<0)

// CH15_DBG_TCR Configuration

#define	DMA_CH15_DBG_TCR_CH15_DBG_TCR								(0xFFFFFFFFu<<0)
#define	DMA_CH15_DBG_TCR_CH15_DBG_TCR_0								(0x1u<<0)
